# <center> LESSON 10*: CONNECT PANDAS WITH SQL </center>

- Step 1: Install [SQLServer](https://dev.mysql.com/downloads/file/?id=506504) and [MySQL Workbench](https://dev.mysql.com/downloads/workbench/)
- Step 2: Open MySQL Workbench
    - Create new database: Righ click in schema region and click `Create a schema` and fill the schema name `BANKING`
    - Write in query: `USE BANKING;` 
    - Load scripts:

`EER Diagram`, `primary key`,`foreign key`

MSSQL Server - sqlalchemy
`!pip install sqlalchemy`
`import sqlachemy as sa
connection = sa.create_engine('mssql://user-name/banking?trusted-connection=yes?')`

In [2]:
!pip install mysql-connector-python

Requirement already satisfied: mysql-connector-python in /Users/hanhtran/miniconda3/envs/hanh/lib/python3.7/site-packages (8.0.25)
Requirement already satisfied: protobuf>=3.0.0 in /Users/hanhtran/miniconda3/envs/hanh/lib/python3.7/site-packages (from mysql-connector-python) (3.17.3)
Requirement already satisfied: six>=1.9 in /Users/hanhtran/miniconda3/envs/hanh/lib/python3.7/site-packages (from protobuf>=3.0.0->mysql-connector-python) (1.15.0)

In [3]:
import mysql.connector #MySQL

In [5]:
connection = mysql.connector.connect(
    host ='localhost',
    user = 'root', #root-admin
    password = '@Mci1234',
    database = 'banking'
) #create a connection between python and database - banking

In [6]:
import pandas as pd
import numpy as np

In [7]:
sql = 'SELECT * FROM ACCOUNT;'
account = pd.read_sql(sql,connection)

In [9]:
account.head(2)

,ACCOUNT_ID,AVAIL_BALANCE,CLOSE_DATE,LAST_ACTIVITY_DATE,OPEN_DATE,PENDING_BALANCE,STATUS,CUST_ID,OPEN_BRANCH_ID,OPEN_EMP_ID,PRODUCT_CD
0,1,1057.75,None,2005-01-04,2000-01-15,1057.75,ACTIVE,1,2,10,CHK
1,2,500.00,None,2004-12-19,2000-01-15,500.00,ACTIVE,1,2,10,SAV

In [10]:
sql = 'SELECT * FROM ACCOUNT LIMIT 2;'
account = pd.read_sql(sql,connection)
account

,ACCOUNT_ID,AVAIL_BALANCE,CLOSE_DATE,LAST_ACTIVITY_DATE,OPEN_DATE,PENDING_BALANCE,STATUS,CUST_ID,OPEN_BRANCH_ID,OPEN_EMP_ID,PRODUCT_CD
0,1,1057.75,None,2005-01-04,2000-01-15,1057.75,ACTIVE,1,2,10,CHK
1,2,500.00,None,2004-12-19,2000-01-15,500.00,ACTIVE,1,2,10,SAV